### Series

In [5]:
import numpy as np
import pandas as pd

In [6]:
a=[1,2,4,5]
b=np.arange(4)
c={'a':10,'b':34,'c':21,'d':32}
d=['a','b','c','d']

In [7]:
pd.Series(a)

0    1
1    2
2    4
3    5
dtype: int64

In [8]:
e=pd.Series(a, d)
e

a    1
b    2
c    4
d    5
dtype: int64

In [10]:
e['a']

1

In [7]:
pd.Series(c)

a    10
b    34
c    21
d    32
dtype: int64

### DataFrames

In [11]:
 from numpy.random import randn

In [12]:
np.random.seed(101)

In [17]:
df= pd.DataFrame(randn(5,5),['a','b','c','d','e'], ['A','B','C','D','E'])
df

          A         B         C         D         E
a  0.484752 -0.116773  1.901755  0.238127  1.996652
b -0.993263  0.196800 -1.136645  0.000366  1.025984
c -0.156598 -0.031579  0.649826  2.154846 -0.610259
d -0.755325 -0.346419  0.147027 -0.479448  0.558769
e  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [22]:
df[['A','B']]

          A         B
a  0.484752 -0.116773
b -0.993263  0.196800
c -0.156598 -0.031579
d -0.755325 -0.346419
e  1.024810 -0.925874

In [24]:
df

          A         B         C         D         E
a  0.484752 -0.116773  1.901755  0.238127  1.996652
b -0.993263  0.196800 -1.136645  0.000366  1.025984
c -0.156598 -0.031579  0.649826  2.154846 -0.610259
d -0.755325 -0.346419  0.147027 -0.479448  0.558769
e  1.024810 -0.925874  1.862864 -1.133817  0.610478

#### Column wise selection

### Axis =0 (row wise)
### Axis=1 (Column wise)

In [26]:
df.drop('E', axis=1, inplace= True)
df

          A         B         C         D
a  0.484752 -0.116773  1.901755  0.238127
b -0.993263  0.196800 -1.136645  0.000366
c -0.156598 -0.031579  0.649826  2.154846
d -0.755325 -0.346419  0.147027 -0.479448
e  1.024810 -0.925874  1.862864 -1.133817

In [ ]:
df.drop('e', axis=0, inplace= True)

In [30]:
df

          A         B         C         D
a  0.484752 -0.116773  1.901755  0.238127
b -0.993263  0.196800 -1.136645  0.000366
c -0.156598 -0.031579  0.649826  2.154846
d -0.755325 -0.346419  0.147027 -0.479448

#### Row-wise selection

In [31]:
df.loc['a']

A    0.484752
B   -0.116773
C    1.901755
D    0.238127
Name: a, dtype: float64

In [32]:
df.iloc[0]

A    0.484752
B   -0.116773
C    1.901755
D    0.238127
Name: a, dtype: float64

In [34]:
df.loc['a', 'A']

0.48475164718163294

In [36]:
df

          A         B         C         D
a  0.484752 -0.116773  1.901755  0.238127
b -0.993263  0.196800 -1.136645  0.000366
c -0.156598 -0.031579  0.649826  2.154846
d -0.755325 -0.346419  0.147027 -0.479448

In [39]:
df.loc[['a', 'b'] ,['A','B']]

          A         B
a  0.484752 -0.116773
b -0.993263  0.196800

#### Conditional selection

In [9]:
import pandas as pd
import numpy as np
from numpy.random import randn

df= pd.DataFrame(randn(5,5),['a','b','c','d','e'], ['A','B','C','D','E'])
df

          A         B         C         D         E
a  1.068228  0.174797 -1.361848 -0.066054 -0.874993
b -0.983616  0.473125 -1.328644 -1.034233 -0.282095
c -1.382351 -0.754680 -1.558237 -0.294500 -1.766400
d -0.493849  1.033463 -0.975744  0.188420  0.789388
e -0.365739  0.345863  2.398097 -0.778957  0.022531

This will get the rows where the condition matches

In [11]:
df[df['A']>1]

          A         B         C         D         E
a  1.068228  0.174797 -1.361848 -0.066054 -0.874993

In [20]:
df[(df["A"]>1) & (df["B"]>0.1)][['A','B']]

          A         B
a  1.068228  0.174797

#### To reset index as column

In [21]:
df.reset_index() # inplace=true

  index         A         B         C         D         E
0     a  1.068228  0.174797 -1.361848 -0.066054 -0.874993
1     b -0.983616  0.473125 -1.328644 -1.034233 -0.282095
2     c -1.382351 -0.754680 -1.558237 -0.294500 -1.766400
3     d -0.493849  1.033463 -0.975744  0.188420  0.789388
4     e -0.365739  0.345863  2.398097 -0.778957  0.022531

In [23]:
df.set_index('A')

                  B         C         D         E
A
 1.068228  0.174797 -1.361848 -0.066054 -0.874993
-0.983616  0.473125 -1.328644 -1.034233 -0.282095
-1.382351 -0.754680 -1.558237 -0.294500 -1.766400
-0.493849  1.033463 -0.975744  0.188420  0.789388
-0.365739  0.345863  2.398097 -0.778957  0.022531

### Multi-index

In [35]:
outside= ['G1','G1','G1','G2','G2','G2']
inside= [1,2,3,1,2,3]
hier_index= list(zip(outside, inside))
hier_index= pd.MultiIndex.from_tuples(hier_index)

In [36]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [37]:
randn(6,2)

array([[-0.65954698, -1.17854675],
       [ 0.33664488,  1.43100035],
       [ 0.28879554, -0.24877043],
       [ 1.71525873, -1.03658674],
       [-0.79163462, -2.38741906],
       [-0.5553023 , -1.25730001]])

In [38]:
# randn(6,2) is an array
# A and B are feature names
df= pd.DataFrame(randn(6,2), hier_index,['A','B'])
df

             A         B
G1 1 -0.082603 -0.300217
   2 -0.876775  0.102511
   3  0.111710  0.428288
G2 1  1.627096  0.564615
   2  0.577904  0.650975
   3 -0.443177  1.633188

In [41]:
df.loc['G1']

          A         B
1 -0.082603 -0.300217
2 -0.876775  0.102511
3  0.111710  0.428288

In [40]:
df.loc['G1']['B']

1   -0.300217
2    0.102511
3    0.428288
Name: B, dtype: float64

In [42]:
df.index.names=['groups', 'num']

In [43]:
df.xs('G1')

            A         B
num
1   -0.082603 -0.300217
2   -0.876775  0.102511
3    0.111710  0.428288

In [45]:
#arguments
# 1: The value from each sub section which you wnat to select
# level is the column from whcih we compare to select
df.xs(1, level='num')

               A         B
groups
G1     -0.082603 -0.300217
G2      1.627096  0.564615

### Missing Data

In [1]:
import pandas as pd
import numpy as np

d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,4]}

df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  4

This will drop the entire row when there is nan in it

In [2]:
df.dropna()

     A    B  C
0  1.0  5.0  1

This will drop the column

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  4

Now setting the threshold to 2, meaning that if there are alteast two non nan value then the row should not be drop

In [7]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.fillna(value='Filled val')

            A           B  C
0         1.0         5.0  1
1         2.0  Filled val  2
2  Filled val  Filled val  4

In [9]:
df['A'].fillna(value= df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

In [10]:
import pandas as pd
import numpy as np

In [11]:
data= {'Company':['GOOG', 'GOOG', 'MSFT',  'MSFT', 'FB', 'FB'],
      'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200,120,340,124,243,350]
      }

In [13]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [17]:
companies= df.groupby('Company').sum()
companies

C:\Users\user\AppData\Local\Temp\ipykernel_13288\3001729222.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  companies= df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [19]:
companies[companies['Sales']>400]

         Sales
Company
FB         593
MSFT       464

### Merging, joining and concatenating

In [20]:
import pandas as pd
import numpy as np

# Create random data for the DataFrames
data1 = np.random.randint(1, 100, size=(4, 4))  # Random integers for DataFrame 1
data2 = np.random.randint(1, 100, size=(4, 4))  # Random integers for DataFrame 2
data3 = np.random.randint(1, 100, size=(4, 4))  # Random integers for DataFrame 3

# Create the DataFrames
df1 = pd.DataFrame(data1, columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(data2, columns=['A', 'B', 'C', 'D'])
df3 = pd.DataFrame(data3, columns=['A', 'B', 'C', 'D'])

print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)
print("\nDataFrame 3:")
print(df3)

DataFrame 1:
    A   B   C   D
0  34  93  57  93
1  50  29  19   7
2  28  74  16  31
3  95  56  58  19

DataFrame 2:
    A   B   C   D
0  21  95  62  90
1  29  66  68  52
2  31   3  35  80
3  45  80  22  63

DataFrame 3:
    A   B   C   D
0  10  99  10   2
1  20  32  99  40
2  42  63  18   4
3  42  18  54  86

The default concat is along the rows, also for the row concatenation then the number and name of columns should be same

In [22]:
pd.concat([df1,df2,df3])

    A   B   C   D
0  34  93  57  93
1  50  29  19   7
2  28  74  16  31
3  95  56  58  19
0  21  95  62  90
1  29  66  68  52
2  31   3  35  80
3  45  80  22  63
0  10  99  10   2
1  20  32  99  40
2  42  63  18   4
3  42  18  54  86

In [23]:
pd.concat([df1,df2,df3], axis=1)

    A   B   C   D   A   B   C   D   A   B   C   D
0  34  93  57  93  21  95  62  90  10  99  10   2
1  50  29  19   7  29  66  68  52  20  32  99  40
2  28  74  16  31  31   3  35  80  42  63  18   4
3  95  56  58  19  45  80  22  63  42  18  54  86

#### Merging

We join on the basis on a column in the below example on Key, now the instances where key from df1 and df2 match then those row will be included

In [24]:
# Create the first DataFrame
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': ['a', 'b', 'c', 'd'],
    'Key': ['K1', 'K2', 'K3', 'K4']
})

# Create the second DataFrame
df2 = pd.DataFrame({
    'A': [5, 6, 7, 8],
    'B': ['e', 'f', 'g', 'h'],
    'Key': ['K1', 'K2', 'K5', 'K6']
})

print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   A  B Key
0  1  a  K1
1  2  b  K2
2  3  c  K3
3  4  d  K4

DataFrame 2:
   A  B Key
0  5  e  K1
1  6  f  K2
2  7  g  K5
3  8  h  K6

In [26]:
pd.merge(df1, df2, how='inner', on='Key')

   A_x B_x Key  A_y B_y
0    1   a  K1    5   e
1    2   b  K2    6   f

#### Join function

Join is done on the basis on indexes while merge is on the basis on columns

In [31]:
import pandas as pd

# Create the first DataFrame
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': ['a', 'b', 'c', 'd']
}, index=['K1', 'K2', 'K3', 'K4'])  # Setting the index for joining

# Create the second DataFrame
df2 = pd.DataFrame({
    'C': [5, 6, 7, 8],
    'D': ['e', 'f', 'g', 'h']
}, index=['K1', 'K2', 'K5', 'K6'])  # Setting the index for joining

print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
    A  B
K1  1  a
K2  2  b
K3  3  c
K4  4  d

DataFrame 2:
    C  D
K1  5  e
K2  6  f
K5  7  g
K6  8  h

In [33]:
df1.join(df2, how="inner")

    A  B  C  D
K1  1  a  5  e
K2  2  b  6  f

In [34]:
df1.join(df2, how="left")

    A  B    C    D
K1  1  a  5.0    e
K2  2  b  6.0    f
K3  3  c  NaN  NaN
K4  4  d  NaN  NaN

In [35]:
df1.join(df2, how="right")

      A    B  C  D
K1  1.0    a  5  e
K2  2.0    b  6  f
K5  NaN  NaN  7  g
K6  NaN  NaN  8  h

In [36]:
df1.join(df2, how="outer")

      A    B    C    D
K1  1.0    a  5.0    e
K2  2.0    b  6.0    f
K3  3.0    c  NaN  NaN
K4  4.0    d  NaN  NaN
K5  NaN  NaN  7.0    g
K6  NaN  NaN  8.0    h

### Operation

In [37]:
df = pd.DataFrame({
    'Col1': [1, 2, 3, 4],   # Integer column
    'Col2': [5, 15, 25, 5],    # Integer column
    'Col3': ['A', 'B', 'C', 'D']  # String column
})

In [38]:
df

   Col1  Col2 Col3
0     1     5    A
1     2    15    B
2     3    25    C
3     4     5    D

In [39]:
df['Col2'].unique()

array([ 5, 15, 25], dtype=int64)

In [40]:
df['Col2'].nunique()

3

How many times the unique values have been repeated

In [41]:
df['Col2'].value_counts()

5     2
15    1
25    1
Name: Col2, dtype: int64

In [42]:
def time2(x):
    return x**2

In [43]:
df['Col2'].apply(time2)

0     25
1    225
2    625
3     25
Name: Col2, dtype: int64

In [44]:
df['Col2'].apply(lambda x: x**2)

0     25
1    225
2    625
3     25
Name: Col2, dtype: int64

In [46]:
df.drop('Col2', axis=1)

   Col1 Col3
0     1    A
1     2    B
2     3    C
3     4    D

In [47]:
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

#### Sort by Column

In [48]:
df.sort_values(by= 'Col2')

   Col1  Col2 Col3
0     1     5    A
3     4     5    D
1     2    15    B
2     3    25    C

In [51]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
dtype: int64

### Data Read and write

In [1]:
# pip install sqlalchemy lxml html5lib

In [2]:
import pandas as pd

In [3]:
pwd

'C:\\Users\\user\\Desktop\\Files\\FL\\Python For DS\\3-Pandas'

In [5]:
df= pd.read_excel('Book1.xlsx', sheet_name='Sheet1')

In [6]:
df

,Career Path,Getting Started,Topic Heading
0,Administrative Assistant,What is a Administrative Assistant?,Definition of a Administrative Assistant
1,Administrative Assistant,What is a Administrative Assistant?,What does a Administrative Assistant do?
2,Administrative Assistant,What is a Administrative Assistant?,What does a Administrative Assistant do?
3,Administrative Assistant,What is a Administrative Assistant?,Day to Day Activities for Administrative Assis...
4,Administrative Assistant,What is a Administrative Assistant?,Day to Day Activities for Administrative Assis...
5,Administrative Assistant,What is a Administrative Assistant?,Day to Day Activities for Administrative Assis...

#### Reading html

In [ ]:
data= pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')
data[0] # usually the data is a list and the index 0 has the df

#### Reading from sql

In [8]:
from sqlalchemy import create_engine

In [16]:
engine= create_engine('sqlite:///:memory:')

In [17]:
df.to_sql('my_table', engine)

6

In [19]:
# sqldf= pd.read_sql('my_table', con=engine)

### Exercise

In [52]:
import pandas as pd
import numpy as np

df= pd.read_csv("Salaries.csv", index_col="Id")
df.head()

C:\Users\user\AppData\Local\Temp\ipykernel_700\656639927.py:4: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df= pd.read_csv("Salaries.csv", index_col="Id")

         EmployeeName                                        JobTitle    BasePay OvertimePay   OtherPay  ... TotalPayBenefits  Year  Notes         Agency  Status
Id                                                                                                       ...
1      NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  167411.18         0.0  400184.25  ...        567595.43  2011    NaN  San Francisco     NaN
2        GARY JIMENEZ                 CAPTAIN III (POLICE DEPARTMENT)  155966.02   245131.88  137811.38  ...        538909.28  2011    NaN  San Francisco     NaN
3      ALBERT PARDINI                 CAPTAIN III (POLICE DEPARTMENT)  212739.13   106088.18    16452.6  ...        335279.91  2011    NaN  San Francisco     NaN
4   CHRISTOPHER CHONG            WIRE ROPE CABLE MAINTENANCE MECHANIC    77916.0    56120.71   198306.9  ...        332343.61  2011    NaN  San Francisco     NaN
5     PATRICK GARDNER    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)   134401.6      9737.0  182234.59  ...        326373.19  2011    NaN  San Francisco     NaN

[5 rows x 12 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148654 entries, 1 to 148654
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148654 non-null  object
 1   JobTitle          148654 non-null  object
 2   BasePay           148049 non-null  object
 3   OvertimePay       148654 non-null  object
 4   OtherPay          148654 non-null  object
 5   Benefits          112495 non-null  object
 6   TotalPay          148654 non-null  float64
 7   TotalPayBenefits  148654 non-null  float64
 8   Year              148654 non-null  int64
 9   Notes             0 non-null       float64
 10  Agency            148654 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(3), int64(1), object(8)
memory usage: 14.7+ MB

In [5]:
df.isna().sum()

EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [6]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

what is job title of joseph

In [14]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']

       EmployeeName                   JobTitle    BasePay OvertimePay  OtherPay Benefits   TotalPay  TotalPayBenefits  Year  Notes         Agency Status
Id
25  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION  140546.86    97868.77  31909.28      NaN  270324.91         270324.91  2011    NaN  San Francisco    NaN

In [15]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

Id
25    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

what is the total salary of jos

In [25]:
df[df['EmployeeName']=='JOSEPH DRISCOLL'][['Benefits','BasePay','OvertimePay', 'OtherPay']].sum(axis=1)

Id
25    270324.91
dtype: float64

In [46]:
salaries=df[['Benefits','BasePay','OvertimePay', 'OtherPay']].sum(axis=1)
salaries

Id
1                                                567595.43
2                                                538909.28
3                                                335279.91
4                                                332343.61
5                                                326373.19
                                ...
148650                                    0.000.000.000.00
148651    Not ProvidedNot ProvidedNot ProvidedNot Provided
148652    Not ProvidedNot ProvidedNot ProvidedNot Provided
148653    Not ProvidedNot ProvidedNot ProvidedNot Provided
148654                                 0.000.000.00-618.13
Length: 148654, dtype: object

In [54]:
df.groupby('Year').mean()

C:\Users\user\AppData\Local\Temp\ipykernel_700\1112703792.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Year').mean()

          TotalPay  TotalPayBenefits  Notes
Year
2011  71744.103871      71744.103871    NaN
2012  74113.262265     100553.229232    NaN
2013  77611.443142     101440.519714    NaN
2014  75463.918140     100250.918884    NaN

Top 5 most common job

In [56]:
df['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

how many job titles were represented by only one person in 2013

In [64]:
df[df['Year']==2013]['JobTitle'].value_counts()==1

Transit Operator                  False
Special Nurse                     False
Registered Nurse                  False
Public Svc Aide-Public Works      False
Custodian                         False
                                  ...
Sr General Utility Mechanic        True
Sprv Adult Prob Ofc (SFERS)        True
Mayoral Staff XII                  True
Pr Investigator, Tax Collector     True
Senior Assessment Clerk            True
Name: JobTitle, Length: 1051, dtype: bool

In [67]:
df['JobTitle'].str.contains('Chief',case= False, na=False).shape[0]

148654

In [ ]:
df['JobTitle'].apply(lambda x: applylen(x))# applylen is a function which can be defined later